Revit 2023 API
PipingSystemType.FluidTemperature Property
 Fluid Temperature
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public double FluidTemperature { get; set; }
Visual Basic
Public Property FluidTemperature As Double
	Get
	Set
Visual C++
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace